## 🏗️ Terraform Plan (Approved for Deployment)
  
  **📋 Plan Metadata:**
  - **Commit SHA:** `f431363ab1879740ec9616f2ca9e84b6cb3acd02`
  - **Plan Hash:** `b0197ef1ba98e27fa6eefab9a1a3583955b37b8fe478fcd1d21f3483aa8e321f`
  - **ZIP Hash:** `be3737ca7d011a5d982c8b5ac7e5b8d014a5ce91f999491dadcbdde988d03943`
  - **Cache Key:** `terraform-approved-plan-f431363ab1879740ec9616f2ca9e84b6cb3acd02`
  - **Environment:** dev
  - **Created:** 2026-03-03T18:00:55Z
  
  <details>
  <summary>📋 Click to expand plan details</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.lambda_dashboard will be created
  + resource "aws_cloudwatch_dashboard" "lambda_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Duration",
                                  + "FunctionName",
                                  + "terraform-learning-dev-example-lambda",
                                ],
                              + [
                                  + ".",
                                  + "Errors",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "Invocations",
                                  + ".",
                                  + ".",
                                ],
                            ]
                          + period  = 300
                          + region  = "us-east-1"
                          + stacked = false
                          + title   = "Lambda Metrics"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                ]
            }
        )
      + dashboard_name = "terraform-learning-dev-dashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_group.lambda_logs will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/terraform-learning-dev-example-lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "terraform-learning"
        }
    }

  # aws_cloudwatch_metric_alarm.lambda_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_errors" {
      + actions_enabled                       = true
      + alarm_description                     = "This metric monitors lambda errors"
      + alarm_name                            = "terraform-learning-dev-lambda-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "terraform-learning-dev-example-lambda"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "terraform-learning"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-learning-dev-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "terraform-learning"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.lambda_s3_policy will be created
  + resource "aws_iam_role_policy" "lambda_s3_policy" {
      + id          = (known after apply)
      + name        = "terraform-learning-dev-lambda-s3-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "terraform-learning-dev-lambda-role"
    }

  # aws_lambda_function.example will be created
  + resource "aws_lambda_function" "example" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./lambda_function.zip"
      + function_name                  = "terraform-learning-dev-example-lambda"
      + handler                        = "lambda_function.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "vjc3yn0BGl2YLItax+W40BSlzpH5mUkdrcvd6YjQOUM="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "terraform-learning"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "terraform-learning"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.example will be created
  + resource "aws_s3_bucket_public_access_block" "example" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.example will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "example" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.example will be created
  + resource "aws_s3_bucket_versioning" "example" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # random_string.bucket_suffix will be created
  + resource "random_string" "bucket_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_dashboard_url  = "https://us-east-1.console.aws.amazon.com/cloudwatch/home?region=us-east-1#dashboards:name=terraform-learning-dev-dashboard"
  + cloudwatch_log_group_name = "/aws/lambda/terraform-learning-dev-example-lambda"
  + lambda_function_arn       = (known after apply)
  + lambda_function_name      = "terraform-learning-dev-example-lambda"
  + s3_bucket_arn             = (known after apply)
  + s3_bucket_name            = (known after apply)
  + vpc_id                    = "vpc-0b589b1a958726e3f"

  ```
  
  </details>
  
  **✅ This exact plan will be applied when merged to main**
  
  **Plan Status:** ✅ Success  
  **Triggered by:** @fperez84  
  **PR:** #7